In [1]:
####BASIC STATS 2####

In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
from scipy import stats as stats

In [2]:
inp=pd.read_csv(r'C:\Users\goura\Downloads\Gaurav_data_science\Basic Python Stats Modelling\Assignments\STATS Assignments\8. Basic Stats - Case Study-2\Testing_Of_Hypothesis.csv')

In [5]:
inp

    Sr No S_Cust_id  Samsung Score Apple_Cust_id  Apple_Score
0       1   S336499             94       A336525           82
1       2    S73004             99        A73011           83
2       3    S79537             74        A79538           88
3       4   S769168             74       A769222           80
4       5   S609791             83       A609801           74
..    ...       ...            ...           ...          ...
95     96   S285617             77       A285629           87
96     97   S324135             85       A324151           82
97     98   S292076             83       A292091           88
98     99   S936528             82       A936566           91
99    100   S489010            100       A489031           95

[100 rows x 5 columns]

In [35]:
inp.rename(columns={'Samsung Score':'Samsung_Score'},inplace=True)

In [36]:
inp

    Sr No S_Cust_id  Samsung_Score Apple_Cust_id  Apple_Score
0       1   S336499             94       A336525           82
1       2    S73004             99        A73011           83
2       3    S79537             74        A79538           88
3       4   S769168             74       A769222           80
4       5   S609791             83       A609801           74
..    ...       ...            ...           ...          ...
95     96   S285617             77       A285629           87
96     97   S324135             85       A324151           82
97     98   S292076             83       A292091           88
98     99   S936528             82       A936566           91
99    100   S489010            100       A489031           95

[100 rows x 5 columns]

In [37]:
####1.The Samsung Average customer satisfaction score is minimum 75%.

In [38]:
####  NULL HYPOTHESIS:
##Ho:The Samsung Average customer satisfaction score is less than 75.(i.e ACS<75).
#### ALTERNATIVE HYPOTHESIS:
##Ha:The Samsung Average customer satisfaction score is greater than or equalto 75.(i.e ACS>=75).
####  Confidence Interval 95%,
####  p value=0.05
#### Performing one sample t test
####  As p value is low, we will reject the NULL hypothesis.
##(i.e. The Samsung Average customer satisfaction score is NOT less than 75).

In [39]:
stats.ttest_1samp(inp.Samsung_Score,popmean=75)

Ttest_1sampResult(statistic=8.358287450922418, pvalue=4.0739777034636007e-13)

In [40]:
#### As p value is low, we will reject the null hypothesis.

In [41]:
### This is also evident if we calculate the mean of the Samsung Score.
inp.Samsung_Score.mean()

84.9

In [42]:
####2.The overall average satisfaction score of Samsung is same as Apple. 
####There is no significant difference in the satisfaction scores.

In [43]:
####  NULL HYPOTHESIS
##Ho:-The overall average satisfaction score of Samsung is same as Apple(i.e. )msams!=mappl
#### ALTERNATIVE HYPOTHESIS 
##Ha:-msams=mappl
####  CI=95%,
####  p value=0.05
#### Performing F Test(ANOVA)
#### BUSINESS CONCLUSION:
## As p value is low, we will reject the null hypothesis.
## But if CI is 99% than we have to accept the null hypothesis i.e we can reject null hypothesis at 95% CI but not at 99% CI

In [18]:
stats.f_oneway(inp.Samsung_Score,inp.Apple_Score)

F_onewayResult(statistic=3.6344737949891592, pvalue=0.05804261444411817)

In [ ]:
#### As p value is low, we will reject the null hypothesis.
#### But if CI is 99% than we have to accept the null hypothesis i.e we can reject null hypothesis at 95% CI but not at 99% CI